
print(r"░█████╗░░█████╗░███╗░░░███╗██████╗░  ████████╗██╗░░██╗██╗███╗░░██╗██╗░░██╗██╗███╗░░██╗░██████╗░")
print(r"██╔══██╗██╔══██╗████╗░████║██╔══██╗  ╚══██╔══╝██║░░██║██║████╗░██║██║░██╔╝██║████╗░██║██╔════╝░")
print(r"██║░░╚═╝██║░░██║██╔████╔██║██████╔╝  ░░░██║░░░███████║██║██╔██╗██║█████═╝░██║██╔██╗██║██║░░██╗░")
print(r"██║░░██╗██║░░██║██║╚██╔╝██║██╔═══╝░  ░░░██║░░░██╔══██║██║██║╚████║██╔═██╗░██║██║╚████║██║░░╚██╗")
print(r"╚█████╔╝╚█████╔╝██║░╚═╝░██║██║░░░░░  ░░░██║░░░██║░░██║██║██║░╚███║██║░╚██╗██║██║░╚███║╚██████╔╝")
print(r"░╚════╝░░╚════╝░╚═╝░░░░░╚═╝╚═╝░░░░░  ░░░╚═╝░░░╚═╝░░╚═╝╚═╝╚═╝░░╚══╝╚═╝░░╚═╝╚═╝╚═╝░░╚══╝░╚═════╝░")
print("")
print(r"██████╗░░░███╗░░")
print(r"██╔══██╗░████║░░")
print(r"██████╔╝██╔██║░░")
print(r"██╔═══╝░╚═╝██║░░")
print(r"██║░░░░░███████╗")
print(r"╚═╝░░░░░╚══════╝ ")                                                   
print("")
input(r">>Press Enter ")
print("")

name = input("Whats your name? ")

print(f"Hi {name}! I'm a reporter and I need your help writing a fake news report to prank my friends! ")
secret = input("Press Enter ")

reportername = input("what's my name? ")
animal = input("what animal should be in the story? ")
city = input("what city is the report in? ")
feeling = input("what is a feeling that should be in the report? ")
thingsbreaking = input("what are some objects that should be broken in the story? ")
ending = input("if you want a bad ending press 1, but if you want a happy ending press 2. ")
print("")
print(r"*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*~~~~~~*")
print(f"Good morning americans! I'm {reportername} and have some terrifying news today.")
input(r">>| Press Enter to read more")

print(f"A rabid, giant-sized {animal} was found in {city} today and has been destroying buildings and {thingsbreaking}.")
input("")

print(f"Wildlife experts say that the {animal} is destroying {thingsbreaking} because it is {feeling}")
input("")

print(f"the FBI is coming in via helicopter to assess the damage of {city} as we speak.")
input("")


print(r"██████╗░██████╗░███████╗░█████╗░██╗░░██╗██╗███╗░░██╗░██████╗░  ███╗░░██╗███████╗░██╗░░░░░░░██╗░██████╗██╗")
print(r"██╔══██╗██╔══██╗██╔════╝██╔══██╗██║░██╔╝██║████╗░██║██╔════╝░  ████╗░██║██╔════╝░██║░░██╗░░██║██╔════╝██║")
print(r"██████╦╝██████╔╝█████╗░░███████║█████═╝░██║██╔██╗██║██║░░██╗░  ██╔██╗██║█████╗░░░╚██╗████╗██╔╝╚█████╗░██║")
print(r"██╔══██╗██╔══██╗██╔══╝░░██╔══██║██╔═██╗░██║██║╚████║██║░░╚██╗  ██║╚████║██╔══╝░░░░████╔═████║░░╚═══██╗╚═╝")
print(r"██████╦╝██║░░██║███████╗██║░░██║██║░╚██╗██║██║░╚███║╚██████╔╝  ██║░╚███║███████╗░░╚██╔╝░╚██╔╝░██████╔╝██╗")
print(r"╚═════╝░╚═╝░░╚═╝╚══════╝╚═╝░░╚═╝╚═╝░░╚═╝╚═╝╚═╝░░╚══╝░╚═════╝░  ╚═╝░░╚══╝╚══════╝░░░╚═╝░░░╚═╝░░╚═════╝░╚═╝")
print("")

input("")
print("")


if ending == "2":
    print(f"The {animal} just got caught and {city} is saved!")
else:
    print(f"The {animal} just destroyed the last building in {city} and lumbers off to destroy the next city in its way.")


print("")
print("")
print("")

input("")

print(r"████████╗██╗░░██╗███████╗  ███████╗███╗░░██╗██████╗░")
print(r"╚══██╔══╝██║░░██║██╔════╝  ██╔════╝████╗░██║██╔══██╗")
print(r"░░░██║░░░███████║█████╗░░  █████╗░░██╔██╗██║██║░░██║")
print(r"░░░██║░░░██╔══██║██╔══╝░░  ██╔══╝░░██║╚████║██║░░██║")
print(r"░░░██║░░░██║░░██║███████╗  ███████╗██║░╚███║██████╔╝")
print(r"░░░╚═╝░░░╚═╝░░╚═╝╚══════╝  ╚══════╝╚═╝░░╚══╝╚═════╝░")
print(r"~~~~~~𝓫𝔂 𝓲𝓼𝓪𝓪𝓬~~~~~~")

if secret == "secrets":
    print("you have unlocked the secret! Tell Isaac you did this and you get a piece of candy/gum")
else:
    print("")